app/controllers/posts_controller.rb

  def index
    # authorize! :read, Post
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hassy"], ["content", "test for the post"], ["user_id", 1], ["created_at", "2021-09-27 16:40:58.324199"], ["updated_at", "2021-09-27 16:40:58.324199"]]